<h3>Load in Data Train</h3>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df_train = pd.read_csv('~/python/Sanbercode/Pekan 4/Final Project/train.csv')
df_train.head()

,id,Umur,Kelas Pekerja,Berat Akhir,Pendidikan,Jmlh Tahun Pendidikan,Status Perkawinan,Pekerjaan,Jenis Kelamin,Keuntungan Kapital,Kerugian Capital,Jam per Minggu,Gaji
0,0,21,Wiraswasta,242912,SMA,9,Belum Pernah Menikah,Servis Lainnya,Perempuan,0.0,0.0,35.0,<=7jt
1,1,49,Wiraswasta,140782,10th,6,Cerai,Ekesekutif Managerial,Perempuan,0.0,0.0,40.0,<=7jt
2,2,44,Wiraswasta,120057,D3,12,Menikah,Ekesekutif Managerial,Laki2,61404000.0,0.0,45.0,>7jt
3,3,24,Wiraswasta,194630,Sarjana,13,Belum Pernah Menikah,Spesialis,Laki2,0.0,0.0,35.0,<=7jt
4,4,33,Wiraswasta,219619,Master,14,Menikah,Spesialis,Laki2,210336000.0,0.0,40.0,>7jt

<h3>Data Train Preparation</h3>

In [2]:
df_train.isna().sum()

id                       0
Umur                     0
Kelas Pekerja            0
Berat Akhir              0
Pendidikan               0
Jmlh Tahun Pendidikan    0
Status Perkawinan        0
Pekerjaan                0
Jenis Kelamin            0
Keuntungan Kapital       0
Kerugian Capital         0
Jam per Minggu           0
Gaji                     0
dtype: int64

In [3]:
df_train['Berat Akhir'] = df_train['Berat Akhir'].fillna(method='ffill')
df_train['Pendidikan'] = df_train['Pendidikan'].fillna(method='ffill')
df_train['Jmlh Tahun Pendidikan'] = df_train['Jmlh Tahun Pendidikan'].fillna(method='ffill')
df_train['Status Perkawinan'] = df_train['Status Perkawinan'].fillna(method='ffill')
df_train['Pekerjaan'] = df_train['Pekerjaan'].fillna(method='ffill')
df_train['Jenis Kelamin'] = df_train['Jenis Kelamin'].fillna(method='ffill')
df_train['Keuntungan Kapital'] = df_train['Keuntungan Kapital'].fillna(method='ffill')
df_train['Kerugian Capital'] = df_train['Kerugian Capital'].fillna(method='ffill')
df_train['Jam per Minggu'] = df_train['Jam per Minggu'].fillna(method='ffill')
df_train['Gaji'] = df_train['Gaji'].fillna(method='ffill')

In [4]:
df_train = df_train.drop('id', axis = 1, inplace = False)
df_train.head()

,Umur,Kelas Pekerja,Berat Akhir,Pendidikan,Jmlh Tahun Pendidikan,Status Perkawinan,Pekerjaan,Jenis Kelamin,Keuntungan Kapital,Kerugian Capital,Jam per Minggu,Gaji
0,21,Wiraswasta,242912,SMA,9,Belum Pernah Menikah,Servis Lainnya,Perempuan,0.0,0.0,35.0,<=7jt
1,49,Wiraswasta,140782,10th,6,Cerai,Ekesekutif Managerial,Perempuan,0.0,0.0,40.0,<=7jt
2,44,Wiraswasta,120057,D3,12,Menikah,Ekesekutif Managerial,Laki2,61404000.0,0.0,45.0,>7jt
3,24,Wiraswasta,194630,Sarjana,13,Belum Pernah Menikah,Spesialis,Laki2,0.0,0.0,35.0,<=7jt
4,33,Wiraswasta,219619,Master,14,Menikah,Spesialis,Laki2,210336000.0,0.0,40.0,>7jt

In [5]:
df_train['Kelas Pekerja'].value_counts()

Wiraswasta                       24948
Pekerja Bebas Bukan Perusahan     2866
Pemerintah Lokal                  2280
?                                 2063
Pemerintah Negara                 1477
Pekerja Bebas Perusahaan          1273
Pemerintah Provinsi               1066
Tanpa di Bayar                      15
Tidak Pernah Bekerja                 6
Name: Kelas Pekerja, dtype: int64

In [6]:
df_train['Pendidikan'].value_counts()

SMA                     11666
Pendidikan Tinggi        8005
Sarjana                  5928
Master                   1944
D4                       1500
11th                     1315
D3                       1175
10th                     1024
7th-8th                   682
Sekolah Professional      622
9th                       570
12th                      478
Doktor                    451
5th-6th                   388
1st-4th                   184
SD                         62
Name: Pendidikan, dtype: int64

In [7]:
df_train['Status Perkawinan'].value_counts()

Menikah                 16559
Belum Pernah Menikah    11851
Cerai                    4857
Berpisah                 1133
Janda                    1103
Menikah LDR               491
Name: Status Perkawinan, dtype: int64

In [8]:
df_train['Pekerjaan'].value_counts()

Spesialis                4587
Perbaikan Kerajinan      4507
Ekesekutif Managerial    4481
Pemuka Agama             4158
Sales                    4044
Servis Lainnya           3615
Mesin Inspeksi           2250
?                        2069
Supir                    1741
Pembersih                1540
Petani                   1076
Tech-support             1042
Penjaga                   686
Asisten Rumah Tangga      187
Tentara                    11
Name: Pekerjaan, dtype: int64

In [9]:
df_train['Gaji'].value_counts()

<=7jt    27364
>7jt      8630
Name: Gaji, dtype: int64

In [10]:
df_train['Jam per Minggu'].value_counts()

40.0    16842
50.0     3099
45.0     2023
60.0     1585
35.0     1464
        ...
69.0        1
95.0        1
74.0        1
81.0        1
94.0        1
Name: Jam per Minggu, Length: 94, dtype: int64

In [11]:
df_train['Jmlh Tahun Pendidikan'] = df_train['Jmlh Tahun Pendidikan'].astype(int)

In [12]:
from sklearn import preprocessing 
label_encoder = preprocessing.LabelEncoder() 

#Jenis Kelamin Column  
df_train['Jenis Kelamin']= label_encoder.fit_transform(df_train['Jenis Kelamin']) 

#Pendidikan Column  
df_train['Pendidikan']= label_encoder.fit_transform(df_train['Pendidikan']) 

#Gaji Column  
df_train['Gaji']= label_encoder.fit_transform(df_train['Gaji'])

In [13]:
df_train.head()

,Umur,Kelas Pekerja,Berat Akhir,Pendidikan,Jmlh Tahun Pendidikan,Status Perkawinan,Pekerjaan,Jenis Kelamin,Keuntungan Kapital,Kerugian Capital,Jam per Minggu,Gaji
0,21,Wiraswasta,242912,13,9,Belum Pernah Menikah,Servis Lainnya,1,0.0,0.0,35.0,0
1,49,Wiraswasta,140782,0,6,Cerai,Ekesekutif Managerial,1,0.0,0.0,40.0,0
2,44,Wiraswasta,120057,7,12,Menikah,Ekesekutif Managerial,0,61404000.0,0.0,45.0,1
3,24,Wiraswasta,194630,14,13,Belum Pernah Menikah,Spesialis,0,0.0,0.0,35.0,0
4,33,Wiraswasta,219619,10,14,Menikah,Spesialis,0,210336000.0,0.0,40.0,1

In [14]:
df_train = pd.get_dummies(df_train, columns=['Kelas Pekerja', 'Status Perkawinan', 'Pekerjaan'])
df_train.head()

,Umur,Berat Akhir,Pendidikan,Jmlh Tahun Pendidikan,Jenis Kelamin,Keuntungan Kapital,Kerugian Capital,Jam per Minggu,Gaji,Kelas Pekerja_?,...,Pekerjaan_Pemuka Agama,Pekerjaan_Penjaga,Pekerjaan_Perbaikan Kerajinan,Pekerjaan_Petani,Pekerjaan_Sales,Pekerjaan_Servis Lainnya,Pekerjaan_Spesialis,Pekerjaan_Supir,Pekerjaan_Tech-support,Pekerjaan_Tentara
0,21,242912,13,9,1,0.0,0.0,35.0,0,0,...,0,0,0,0,0,1,0,0,0,0
1,49,140782,0,6,1,0.0,0.0,40.0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,44,120057,7,12,0,61404000.0,0.0,45.0,1,0,...,0,0,0,0,0,0,0,0,0,0
3,24,194630,14,13,0,0.0,0.0,35.0,0,0,...,0,0,0,0,0,0,1,0,0,0
4,33,219619,10,14,0,210336000.0,0.0,40.0,1,0,...,0,0,0,0,0,0,1,0,0,0

In [15]:
from sklearn.model_selection import train_test_split

x = df_train.drop('Gaji', axis = 1, inplace = False)
y = df_train['Gaji']
x_train, x_test, y_train, y_test = train_test_split(x,y, test_size=0.25, stratify=y, random_state=21)

In [16]:
x_train.shape

(26995, 38)

In [17]:
x_test.shape

(8999, 38)

In [18]:
y_train.shape

(26995,)

In [19]:
y_test.shape

(8999,)

<h3>Grid Search</h3>

In [20]:
from sklearn.model_selection import GridSearchCV
from sklearn.ensemble import RandomForestRegressor

# Create the parameter grid based on the results of random search 
param_grid = {
    'bootstrap': [True],
    'max_depth': [80, 90, 100, 110],
    'max_features': [2, 3],
    'min_samples_leaf': [3, 4, 5],
    'min_samples_split': [8, 10, 12],
    'n_estimators': [100, 200, 300, 1000]
}

# Create a base model
rf = RandomForestRegressor(random_state = 42)

# Instantiate the grid search model
grid_search = GridSearchCV(estimator = rf, param_grid = param_grid, 
                          cv = 3, n_jobs = -1, verbose = 2, return_train_score=True)

In [21]:
# Fit the grid search to the data
grid_search.fit(x_train, y_train)

Fitting 3 folds for each of 288 candidates, totalling 864 fits

[Parallel(n_jobs=-1)]: Using backend LokyBackend with 4 concurrent workers.
[Parallel(n_jobs=-1)]: Done  33 tasks      | elapsed:  4.6min
[Parallel(n_jobs=-1)]: Done 154 tasks      | elapsed: 19.2min
[Parallel(n_jobs=-1)]: Done 357 tasks      | elapsed: 41.6min
[Parallel(n_jobs=-1)]: Done 640 tasks      | elapsed: 72.2min
[Parallel(n_jobs=-1)]: Done 864 out of 864 | elapsed: 96.4min finished

GridSearchCV(cv=3, estimator=RandomForestRegressor(random_state=42), n_jobs=-1,
             param_grid={'bootstrap': [True], 'max_depth': [80, 90, 100, 110],
                         'max_features': [2, 3], 'min_samples_leaf': [3, 4, 5],
                         'min_samples_split': [8, 10, 12],
                         'n_estimators': [100, 200, 300, 1000]},
             return_train_score=True, verbose=2)

<h3>Looking for the best parameter</h3>

In [22]:
grid_search.best_params_

{'bootstrap': True,
 'max_depth': 80,
 'max_features': 3,
 'min_samples_leaf': 3,
 'min_samples_split': 8,
 'n_estimators': 1000}

<h3>Fitting the Random Forest Regression Model</h3>

In [23]:
model = RandomForestRegressor(max_depth=80, min_samples_split=8, 
                              min_samples_leaf=3, n_estimators=1000, max_features=3, bootstrap=True)
model.fit(x_train, y_train)

RandomForestRegressor(max_depth=80, max_features=3, min_samples_leaf=3,
                      min_samples_split=8, n_estimators=1000)

In [24]:
y_predict = model.predict(x_test)

<h3>Predict Random Forest Regression Results</h3>

In [25]:
from sklearn.metrics import roc_auc_score

score = roc_auc_score(y_test, y_predict)
score

0.9121874474611252

In [26]:
y_predict

array([0.00372775, 0.02167382, 0.21725646, ..., 0.00174763, 0.85740525,
       0.15612489])

<h3>Load in Data Test</h3>

In [32]:
df_test = pd.read_csv('~/python/Sanbercode/Pekan 4/Final Project/test.csv')

<h3>Data Test Preparation</h3>

In [33]:
df_test.isna().sum()

id                       0
Umur                     0
Kelas Pekerja            0
Berat Akhir              0
Pendidikan               0
Jmlh Tahun Pendidikan    0
Status Perkawinan        0
Pekerjaan                0
Jenis Kelamin            0
Keuntungan Kapital       0
Kerugian Capital         0
Jam per Minggu           0
dtype: int64

In [34]:
df_test['Berat Akhir'] = df_test['Berat Akhir'].fillna(method='ffill')
df_test['Pendidikan'] = df_test['Pendidikan'].fillna(method='ffill')
df_test['Jmlh Tahun Pendidikan'] = df_test['Jmlh Tahun Pendidikan'].fillna(method='ffill')
df_test['Status Perkawinan'] = df_test['Status Perkawinan'].fillna(method='ffill')
df_test['Pekerjaan'] = df_test['Pekerjaan'].fillna(method='ffill')
df_test['Jenis Kelamin'] = df_test['Jenis Kelamin'].fillna(method='ffill')
df_test['Keuntungan Kapital'] = df_test['Keuntungan Kapital'].fillna(method='ffill')
df_test['Kerugian Capital'] = df_test['Kerugian Capital'].fillna(method='ffill')
df_test['Jam per Minggu'] = df_test['Jam per Minggu'].fillna(method='ffill')

In [35]:
df_test['Jmlh Tahun Pendidikan'] = df_test['Jmlh Tahun Pendidikan'].astype(int)

In [36]:
from sklearn import preprocessing 
label_encoder = preprocessing.LabelEncoder() 

#Jenis Kelamin Column  
df_test['Jenis Kelamin']= label_encoder.fit_transform(df_test['Jenis Kelamin']) 

#Pendidikan Column  
df_test['Pendidikan']= label_encoder.fit_transform(df_test['Pendidikan'])

In [37]:
df_test = pd.get_dummies(df_test, columns=['Kelas Pekerja', 'Status Perkawinan', 'Pekerjaan'])
df_test.head()

,id,Umur,Berat Akhir,Pendidikan,Jmlh Tahun Pendidikan,Jenis Kelamin,Keuntungan Kapital,Kerugian Capital,Jam per Minggu,Kelas Pekerja_?,...,Pekerjaan_Pemuka Agama,Pekerjaan_Penjaga,Pekerjaan_Perbaikan Kerajinan,Pekerjaan_Petani,Pekerjaan_Sales,Pekerjaan_Servis Lainnya,Pekerjaan_Spesialis,Pekerjaan_Supir,Pekerjaan_Tech-support,Pekerjaan_Tentara
0,35994,30,99761,8,11,1,0.0,0.0,40.0,0,...,1,0,0,0,0,0,0,0,0,0
1,35995,28,202206,13,9,0,0.0,0.0,50.0,0,...,0,0,0,0,0,0,0,0,0,0
2,35996,34,199934,11,10,0,0.0,0.0,40.0,0,...,1,0,0,0,0,0,0,0,0,0
3,35997,51,373448,11,10,0,0.0,28028000.0,40.0,0,...,0,0,0,0,0,0,0,0,0,0
4,35998,20,144685,11,10,1,0.0,22428000.0,40.0,1,...,0,0,0,0,0,0,0,0,0,0

In [38]:
df_id = df_test['id']
df_test = df_test.drop('id', axis=1)

<h3>Make Prediction with Data Test</h3>

In [39]:
predict = model.predict(df_test)

In [40]:
df_new = pd.DataFrame({'Gaji' : predict})

In [56]:
submission = pd.merge(df_id, df_new, how='outer', left_index=True, right_index=True)
submission.head()

      id      Gaji
0  35994  0.026458
1  35995  0.170765
2  35996  0.514172
3  35997  0.615385
4  35998  0.002306

In [57]:
new = submission.round(0).astype(int)
new

         id  Gaji
0     35994     0
1     35995     0
2     35996     1
3     35997     1
4     35998     0
...     ...   ...
9594  45588     0
9595  45589     0
9596  45590     0
9597  45591     0
9598  45592     0

[9599 rows x 2 columns]

In [58]:
new['Gaji'].value_counts()

0    7923
1    1676
Name: Gaji, dtype: int64

In [59]:
new

         id  Gaji
0     35994     0
1     35995     0
2     35996     1
3     35997     1
4     35998     0
...     ...   ...
9594  45588     0
9595  45589     0
9596  45590     0
9597  45591     0
9598  45592     0

[9599 rows x 2 columns]

In [62]:
new.to_csv('Prediksi Gaji.csv', index=False)